---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShape.HigherEnd
source: html/e3c2b8f8-5d6b-3bf8-0e9d-68848f2a78fd.htm
---
# Autodesk.Revit.DB.Structure.RebarShape.HigherEnd Property

Defines the higher end of rebar shape.

## Syntax (C#)
```csharp
public int HigherEnd { get; }
```

## Remarks
Change this property will make rebar shape's start and end hooks swap.